vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
/*
 * Copyright  2016 NXP
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_psp27801.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief Send data to OLED via the DSPI.
 * @param  bufPtr  pointer to data which will be send to OLED.
 * @param  txSize  data-size
 * @return         status flag
 */
static oled_status_t OLED_SendViaDSPI(const uint8_t *bufPtr, uint32_t txSize);

/*!
 * @brief Transpose the image
 * @param image      given image
 * @param transImage new image
 */
static void Transpose(oled_pixel_t transImage, const oled_pixel_t image, uint8_t width, uint8_t height);

/*!
 * @brief Trnasition type right->left.
 * @param  image  given image
 * @param  xCrd   image's x-coordinate
 * @param  yCrd   image's y-coordinate
 * @param  width  image's width
 * @param  height image's height
 * @return        status flag
 */
static oled_status_t RightLeft(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height);

/*!
 * @brief Transition type left->right.
 * @param  image  given image
 * @param  xCrd   image's x-coordinate
 * @param  yCrd   image's y-coordinate
 * @param  width  image's width
 * @param  height image's height
 * @return        status flag
 */
static oled_status_t LeftRight(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height);

/*!
 * @brief  Transition type down->top.
 * @param  image  given image
 * @param  xCrd   image's x-coordinate
 * @param  yCrd   image's y-coordinate
 * @param  width  image's width
 * @param  height image's height
 * @return        status flag
 */
static oled_status_t DownTop(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height);

/*!
 * @brief Transition type Top->down .
 * @param  image  given image
 * @param  xCrd   image's x-coordinate
 * @param  yCrd   image's y-coordinate
 * @param  width  image's width
 * @param  height image's height
 * @return        status flag
 */
static oled_status_t TopDown(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height);

/*!
 * @brief Set borders for the box-like object to draw
 * @param  xCrd   x-coordinate for the object
 * @param  yCrd   y-coordinate for the object
 * @param  width  object's width
 * @param  height object's height
 */
static void SetBorders(uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height);

/*!
 * @brief Create the text background
 *
 * @return status flag
 */
static oled_status_t CreateTextBackground(void);

/*!
 * @brief Write the character to the buffer.
 * @param charToWrite  character to be written
 * @param chrBuf       given pointer for buffer for the character
 */
static void WriteCharToBuf(uint16_t charToWrite, oled_pixel_t *chrBuf);

/*!
 * @brief Add character to the active text area.
 * @param  xOffset offset for the x-coordinate
 * @param  yOffset offset for the y-coordinate
 * @param  width   desired width
 * @param  height  desired height
 * @return         status flag
 */
static oled_status_t AddCharToTextArea(
    oled_pixel_t chrPtr, uint8_t chrWidth, uint8_t chrHeight, oled_pixel_t copyAddr, uint8_t imgWidth);

/*!
 * @brief Allocate memory for the desired image/character
 * @param area desired area dimensions
 */
static void *AllocateDynamicArea(uint32_t area);

/*!
 * @brief Deallocate current area
 * @param area pointer to current area
 */
static oled_status_t DestroyDynamicArea(void *ptr);

/*******************************************************************************
 * Variables
 ******************************************************************************/
static uint8_t isFontInitialized = 0;
static const uint8_t *selectedFont;
static uint16_t selectedFont_color;
static uint16_t selectedFont_firstChar;
static uint16_t selectedFont_height;
static oled_dynamic_area_t oled_dynamic_area       = {0};
static oled_text_properties_t oled_text_properties = {.alignParam = OLED_TEXT_ALIGN_CENTER, .background = NULL};
static uint8_t screenBuf[OLED_GRAM_SIZE];
static uint8_t currentChar_width  = 0;
static uint8_t currentChar_height = 0;
static uint16_t colorMask         = GUI_COLOR_WHITE;

/*******************************************************************************
 * Code
 ******************************************************************************/

void OLED_Hardware_Init(void)
{
    gpio_pin_config_t OLED_CS_Config  = {kGPIO_DigitalOutput, 1};
    gpio_pin_config_t OLED_RST_Config = {kGPIO_DigitalOutput, 0};
    gpio_pin_config_t OLED_DC_Config  = {kGPIO_DigitalOutput, 0};
    gpio_pin_config_t OLED_PWR_Config = {kGPIO_DigitalOutput, 1};

    GPIO_PinInit(BOARD_OLED_CS_GPIO, BOARD_OLED_CS_PIN, &OLED_CS_Config);
    GPIO_PinInit(BOARD_OLED_RST_GPIO, BOARD_OLED_RST_PIN, &OLED_RST_Config);
    GPIO_PinInit(BOARD_OLED_DC_GPIO, BOARD_OLED_DC_PIN, &OLED_DC_Config);
    GPIO_PinInit(BOARD_OLED_PWR_GPIO, BOARD_OLED_PWR_PIN, &OLED_PWR_Config);

    dspi_master_config_t masterConfig;

    /*Master config*/
    masterConfig.whichCtar                                = kDSPI_Ctar0;
    masterConfig.ctarConfig.baudRate                      = BOARD_OLED_DSPI_MASTER_TRANSFER_BAUDRATE;
    masterConfig.ctarConfig.bitsPerFrame                  = 8U;
    masterConfig.ctarConfig.cpol                          = kDSPI_ClockPolarityActiveLow;
    masterConfig.ctarConfig.cpha                          = kDSPI_ClockPhaseSecondEdge;
    masterConfig.ctarConfig.direction                     = kDSPI_MsbFirst;
    masterConfig.ctarConfig.pcsToSckDelayInNanoSec        = 64;
    masterConfig.ctarConfig.lastSckToPcsDelayInNanoSec    = 0;
    masterConfig.ctarConfig.betweenTransferDelayInNanoSec = 0;

