vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
    masterConfig.whichPcs                   = kDSPI_Pcs0;
    masterConfig.pcsActiveHighOrLow         = kDSPI_PcsActiveLow;
    masterConfig.enableContinuousSCK        = false;
    masterConfig.enableRxFifoOverWrite      = false;
    masterConfig.enableModifiedTimingFormat = false;
    masterConfig.samplePoint                = kDSPI_SckToSin0Clock;

    DSPI_MasterInit(BOARD_OLED_DSPI_MASTER_BASEADDR, &masterConfig, BOARD_OLED_DSPI_MASTER_CLK_FREQ);
}

static oled_status_t OLED_SendViaDSPI(const uint8_t *txBuffer, uint32_t txSize)
{
    oled_status_t status = OLED_STATUS_SUCCESS;
    status_t dspiStatus  = kStatus_Success;
    dspi_transfer_t masterXfer;

    /* Start master transfer */
    masterXfer.txData      = (uint8_t *)txBuffer;
    masterXfer.rxData      = NULL;
    masterXfer.dataSize    = txSize;
    masterXfer.configFlags = kDSPI_MasterCtar0;
    dspiStatus             = DSPI_MasterTransferBlocking(BOARD_OLED_DSPI_MASTER_BASEADDR, &masterXfer);

    if (kStatus_Success != dspiStatus)
    {
        status = OLED_STATUS_PROTOCOL_ERROR;
    }
    else
    {
        status = OLED_STATUS_SUCCESS;
    }
    return status;
}

oled_status_t OLED_SendCmd(uint32_t cmd, uint8_t isFirst)
{
    uint8_t txSize = 1;
    uint8_t txBuf[4];

    memcpy((void *)txBuf, (void *)&cmd, txSize);

    if (isFirst)
    {
        GPIO_PortClear(BOARD_OLED_DC_GPIO, 1U << BOARD_OLED_DC_PIN);
    }
    else
    {
        GPIO_PortSet(BOARD_OLED_DC_GPIO, 1U << BOARD_OLED_DC_PIN);
    }

    GPIO_PortClear(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);
    oled_status_t spiStatus = OLED_SendViaDSPI(txBuf, txSize);

    if (OLED_STATUS_SUCCESS == spiStatus)
    {
        GPIO_PortSet(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);
        return OLED_STATUS_SUCCESS;
    }
    else
    {
        GPIO_PortSet(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);
        return OLED_STATUS_PROTOCOL_ERROR;
    }
}

oled_status_t OLED_Init(void)
{
    /* Power on the OLED for initialization */
    GPIO_PortClear(BOARD_OLED_PWR_GPIO, 1U << BOARD_OLED_PWR_PIN);
    Timer_Delay_ms(2);
    GPIO_PortClear(BOARD_OLED_RST_GPIO, 1U << BOARD_OLED_RST_PIN);
    Timer_Delay_ms(2);
    GPIO_PortSet(BOARD_OLED_RST_GPIO, 1U << BOARD_OLED_RST_PIN);
    Timer_Delay_ms(2);
    GPIO_PortSet(BOARD_OLED_PWR_GPIO, 1U << BOARD_OLED_PWR_PIN);

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_CMD_LOCK, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_UNLOCK, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_CMD_LOCK, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_ACC_TO_CMD_YES, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_DISPLAYOFF, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_OSC_FREQ_AND_CLOCKDIV, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xF1, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_MUX_RATIO, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x5F, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_REMAP, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_REMAP_SETTINGS, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_COLUMN, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x00, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x5F, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_ROW, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x00, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x5F, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_STARTLINE, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x80, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_DISPLAYOFFSET, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x60, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_PRECHARGE, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x32, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_VCOMH, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x05, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_NORMALDISPLAY, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_CONTRASTABC, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x8A, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x51, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x8A, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

