vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_CONTRASTMASTER, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xCF, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SETVSL, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xA0, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xB5, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x55, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_PRECHARGE2, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0x01, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_DISPLAYON, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_Deinit(void)
{
    /* Deinit the DSPI */
    DSPI_Deinit(BOARD_OLED_DSPI_MASTER_BASEADDR);
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_SendData(const uint8_t *dataToSend, uint32_t dataSize)
{
    oled_status_t spiStatus;

    /* Check if the default color is white */
    if ((GUI_COLOR_WHITE != colorMask))
    {
        uint16_t *arrayPtr = (uint16_t *)dataToSend;

        for (uint32_t i = 0; i < dataSize / 2; i++)
        {
            arrayPtr[i] &= colorMask;
        }
    }
    /* Send command to OLED */
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_WRITERAM, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    /* Set DC pin and CS pin to enable OLED transfer */
    GPIO_PortSet(BOARD_OLED_DC_GPIO, 1U << BOARD_OLED_DC_PIN);
    GPIO_PortClear(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);

    spiStatus = OLED_SendViaDSPI(dataToSend, dataSize);

    if (OLED_STATUS_SUCCESS != spiStatus)
    {
        GPIO_PortSet(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    GPIO_PortSet(BOARD_OLED_CS_GPIO, 1U << BOARD_OLED_CS_PIN);
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_DrawBox(uint16_t xCrd, uint16_t yCrd, uint16_t width, uint16_t height, uint16_t color)
{
    oled_status_t status = OLED_STATUS_SUCCESS;

    oled_dynamic_area_t boxArea;

    boxArea.xCrd   = xCrd;
    boxArea.yCrd   = yCrd;
    boxArea.width  = width;
    boxArea.height = height;

    uint32_t boxSize = width * height;

    OLED_SetDynamicArea(&boxArea);

    /* Helper pointer */
    uint8_t *boxBuf = (uint8_t *)oled_dynamic_area.areaBuffer;

    if (NULL == boxBuf)
    {
        return OLED_STATUS_ERROR;
    }

    /* check the bounds */
    if (AreCoordsNotValid(xCrd, yCrd, width, height))
    {
        status = OLED_STATUS_INIT_ERROR;
    }

    else
    {
        /* Fill the buffer with color */
        for (uint16_t i = 0; i < boxSize; i++)
        {
            boxBuf[2 * i]     = color >> 8;
            boxBuf[2 * i + 1] = color;
        }

        /* Adjust for the offset */
        OLED_AdjustColumnOffset(xCrd);
        OLED_AdjustRowOffset(yCrd);

        if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_COLUMN, FIRST_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(xCrd, OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(xCrd + (width - 1), OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }

        if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_ROW, FIRST_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(yCrd, OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(yCrd + (height - 1), OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }

        /* Fill the GRAM */
        if (OLED_STATUS_SUCCESS != OLED_SendData((uint8_t *)boxBuf, boxSize * OLED_BYTES_PER_PIXEL))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        /* Destory the dynamic area */
        OLED_DestroyDynamicArea();
        status = OLED_STATUS_SUCCESS;
    }

    return status;
}

oled_status_t OLED_FillScreen(uint16_t color)
{
    /* Fill the screen buffer with color */
    for (uint16_t i = 0; i < (OLED_SCREEN_WIDTH * OLED_SCREEN_HEIGHT); i++)
    {
        screenBuf[2 * i]     = color >> 8;
        screenBuf[2 * i + 1] = color;
    }

    /* Set the locations */
    SetBorders(0, 0, OLED_SCREEN_WIDTH, OLED_SCREEN_HEIGHT);

    /* Fill GRAM */
    if (OLED_STATUS_SUCCESS !=
        OLED_SendData((uint8_t *)screenBuf, OLED_SCREEN_WIDTH * OLED_SCREEN_HEIGHT * OLED_BYTES_PER_PIXEL))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_DrawPixel(int16_t xCrd, int16_t yCrd, uint16_t color)
{
    /* Check the bounds */
    if (AreCoordsNotValid(xCrd, yCrd, 1, 1))
    {
        return OLED_STATUS_INIT_ERROR;
    }
    else
    {
        /* Set directions */
        SetBorders(xCrd, yCrd, OLED_SCREEN_WIDTH, OLED_SCREEN_HEIGHT);
        /* swap bytes */
        uint16_t dot = color;
        OLED_SwapMe(dot);

        /* Fill the GRAM */
        if (OLED_STATUS_SUCCESS != OLED_SendData((uint8_t *)&dot, 2))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        return OLED_STATUS_SUCCESS;
    }
}

oled_status_t OLED_DrawScreen(
    const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height, oled_transition_t transition)
{
    oled_status_t status = OLED_STATUS_SUCCESS;

    if (AreCoordsNotValid(xCrd, yCrd, width, height))
    {
        return OLED_STATUS_INIT_ERROR;
    }

    switch (transition)
    {
        case kOLED_Transition_None:
        {
            /* Set the locations */
            SetBorders(xCrd, yCrd, width, height);

