vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
            /* Fill the GRAM */
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)image, width * height * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
            break;
        }

        case kOLED_Transition_Top_Down:
        {
            TopDown(image, xCrd, yCrd, width, height);
            break;
        }

        case kOLED_Transition_Down_Top:
        {
            DownTop(image, xCrd, yCrd, width, height);
            break;
        }

        case kOLED_Transition_Left_Right:
        {
            LeftRight(image, xCrd, yCrd, width, height);
            break;
        }

        case kOLED_Transition_Right_Left:
        {
            RightLeft(image, xCrd, yCrd, width, height);
            break;
        }

        default:
        {
        }
    }

    return status;
}

oled_status_t OLED_SetFont(const uint8_t *newFont, uint16_t newColor)
{
    selectedFont = newFont;

    selectedFont_firstChar = newFont[2] | ((uint16_t)newFont[3] << 8);
    selectedFont_height    = newFont[6];
    selectedFont_color     = newColor;

    OLED_SwapMe(selectedFont_color);

    isFontInitialized = 1;
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_SetDynamicArea(oled_dynamic_area_t *dynamic_area)
{
    if (NULL == oled_dynamic_area.areaBuffer)
    {
        oled_dynamic_area.areaBuffer = (oled_pixel_t)AllocateDynamicArea(dynamic_area->width * dynamic_area->height);
    }
    else if ((dynamic_area->height != oled_dynamic_area.height) || (dynamic_area->width != oled_dynamic_area.width))
    {
        OLED_DestroyDynamicArea();
        oled_dynamic_area.areaBuffer = (oled_pixel_t)AllocateDynamicArea(dynamic_area->width * dynamic_area->height);
    }

    if (!oled_dynamic_area.areaBuffer)
    {
        return OLED_STATUS_ERROR;
    }

    oled_dynamic_area.xCrd   = dynamic_area->xCrd;
    oled_dynamic_area.yCrd   = dynamic_area->yCrd;
    oled_dynamic_area.width  = dynamic_area->width;
    oled_dynamic_area.height = dynamic_area->height;

    return OLED_STATUS_SUCCESS;
}

void OLED_DestroyDynamicArea()
{
    if (NULL != oled_dynamic_area.areaBuffer)
    {
        DestroyDynamicArea(oled_dynamic_area.areaBuffer);
        oled_dynamic_area.areaBuffer = NULL;
    }
}

void OLED_SetTextProperties(oled_text_properties_t *textProperties)
{
    oled_text_properties.font       = textProperties->font;
    oled_text_properties.fontColor  = textProperties->fontColor;
    oled_text_properties.alignParam = textProperties->alignParam;
    oled_text_properties.background = textProperties->background;

    OLED_SetFont(oled_text_properties.font, oled_text_properties.fontColor);
}

uint8_t OLED_GetTextWidth(const uint8_t *text)
{
    uint8_t chrCnt     = 0;
    uint8_t text_width = 0;

    while (0 != text[chrCnt])
    {
        text_width += *(selectedFont + 8 + (uint16_t)((text[chrCnt++] - selectedFont_firstChar) << 2));
        text_width++;
    }

    text_width--;
    return text_width;
}

uint8_t OLED_CharCount(uint8_t width, const uint8_t *font, const uint8_t *text, uint8_t length)
{
    uint8_t chrCnt     = 0;
    uint8_t text_width = 0;
    uint16_t firstChar;

    firstChar = font[2] | ((uint16_t)font[3] << 8);

    while (chrCnt < length)
    {
        text_width += *(font + 8 + (uint16_t)((text[chrCnt++] - firstChar) << 2));
        if (text_width > width)
        {
            chrCnt--;
            break;
        }

        text_width++;
    }

    return chrCnt;
}

oled_status_t OLED_AddText(const uint8_t *text)
{
    uint16_t chrCnt       = 0;
    oled_pixel_t chrBuf   = NULL;
    uint8_t currentChar_x = 0, currentChar_y = 0;
    uint8_t text_height = 0, text_width = 0;

    text_width  = OLED_GetTextWidth(text);
    text_height = selectedFont_height;

    if ((oled_dynamic_area.width < text_width) || (oled_dynamic_area.height < text_height))
    {
        oled_dynamic_area_t textArea = {0};

        textArea.width  = text_width;
        textArea.height = text_height;
        OLED_SetDynamicArea(&textArea);
    }

    currentChar_y = (oled_dynamic_area.height - text_height) >> 1;

    switch (oled_text_properties.alignParam & OLED_TEXT_HALIGN_MASK)
    {
        case OLED_TEXT_ALIGN_LEFT:
        {
            currentChar_x = 0;
            break;
        }

        case OLED_TEXT_ALIGN_RIGHT:
        {
            currentChar_x = (oled_dynamic_area.width - text_width);
            break;
        }

        case OLED_TEXT_ALIGN_CENTER:
        {
            currentChar_x += (oled_dynamic_area.width - text_width) >> 1;
            break;
        }

        default:
        {
            break;
        }
    }

    if (CreateTextBackground() != OLED_STATUS_SUCCESS)
    {
        return OLED_STATUS_ERROR;
    }

    chrCnt = 0;
    while (0 != text[chrCnt])
    {
        WriteCharToBuf(text[chrCnt++], &chrBuf);

        if (NULL == chrBuf)
        {
            return OLED_STATUS_INIT_ERROR;
        }

        else
        {
            if (((currentChar_x + currentChar_width) > oled_dynamic_area.width) ||
                ((currentChar_y + currentChar_height) > oled_dynamic_area.height))
            {
                DestroyDynamicArea(chrBuf);
                chrBuf = NULL;
                return OLED_STATUS_ERROR;
            }

            /* Copy data */
            oled_pixel_t copyAddr =
                oled_dynamic_area.areaBuffer + (currentChar_y * oled_dynamic_area.width + currentChar_x);
            AddCharToTextArea(chrBuf, currentChar_width, currentChar_height, copyAddr, oled_dynamic_area.width);

            currentChar_x += (currentChar_width + 1);
            currentChar_y += 0;

            DestroyDynamicArea(chrBuf);
            chrBuf = NULL;
        }
    }

    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_DrawText(const uint8_t *text)
{
    if (NULL == text)
    {
        return OLED_STATUS_ERROR;
    }

    OLED_AddText(text);

