vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
    /* Set the locations */
    SetBorders(oled_dynamic_area.xCrd, oled_dynamic_area.yCrd, oled_dynamic_area.width, oled_dynamic_area.height);

    /* Fill the GRAM */
    if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)oled_dynamic_area.areaBuffer,
                                             oled_dynamic_area.width * oled_dynamic_area.height * OLED_BYTES_PER_PIXEL))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    return OLED_STATUS_SUCCESS;
}

void OLED_GetImageDimensions(uint8_t *width, uint8_t *height, const uint8_t *image)
{
    *height = image[2] + (image[3] << 8);
    *width  = image[4] + (image[5] << 8);
}

oled_status_t OLED_AddImage(const uint8_t *image)
{
    oled_status_t status = OLED_STATUS_SUCCESS;

    /* Check the bounds */
    if (AreCoordsNotValid(oled_dynamic_area.xCrd, oled_dynamic_area.yCrd, oled_dynamic_area.width,
                          oled_dynamic_area.height))
    {
        status = OLED_STATUS_INIT_ERROR;
    }
    else
    {
        OLED_Swap((oled_pixel_t)oled_dynamic_area.areaBuffer, GuiDriver_SkipHeader(image),
                  oled_dynamic_area.width * oled_dynamic_area.height);
    }

    return status;
}

oled_status_t OLED_DrawImage(const uint8_t *image)
{
    OLED_AddImage(image);

    /* Set the locations */
    SetBorders(oled_dynamic_area.xCrd, oled_dynamic_area.yCrd, oled_dynamic_area.width, oled_dynamic_area.height);

    /* Fill the GRAM */
    if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)oled_dynamic_area.areaBuffer,
                                             oled_dynamic_area.width * oled_dynamic_area.height * OLED_BYTES_PER_PIXEL))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_DimScreenON(void)
{
    for (int i = 0; i < 16; i++)
    {
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_CONTRASTMASTER, FIRST_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xC0 | (0xF - i), OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        Timer_Delay_ms(20);
    }
    return OLED_STATUS_SUCCESS;
}

oled_status_t OLED_DimScreenOFF(void)
{
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_CONTRASTMASTER, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(0xC0 | 0xF, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    return OLED_STATUS_SUCCESS;
}

void OLED_Swap(oled_pixel_t imgDst, const uint8_t *imgSrc, uint16_t imgSize)
{
    for (int var = 0; var < imgSize; var++)
    {
        *imgDst = *imgSrc << 8;
        imgSrc++;
        *imgDst |= *imgSrc;
        imgDst++;
        imgSrc++;
    }
}

/* Intern functions */
static void SetBorders(uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height)
{
    oled_status_t oledStatus;

    /* Adjust for the offset */
    OLED_AdjustColumnOffset(xCrd);
    OLED_AdjustRowOffset(yCrd);

    while (1)
    {
        oledStatus = OLED_STATUS_SUCCESS;

        oledStatus |= OLED_SendCmd(OLED_CMD_SET_COLUMN, FIRST_BYTE);
        oledStatus |= OLED_SendCmd(xCrd, OTHER_BYTE);
        oledStatus |= OLED_SendCmd(xCrd + (width - 1), OTHER_BYTE);
        oledStatus |= OLED_SendCmd(OLED_CMD_SET_ROW, FIRST_BYTE);
        oledStatus |= OLED_SendCmd(yCrd, OTHER_BYTE);
        oledStatus |= OLED_SendCmd(yCrd + (height - 1), OTHER_BYTE);

        if (OLED_STATUS_SUCCESS == oledStatus)
        {
            break;
        }
    }
}

static void WriteCharToBuf(uint16_t charToWrite, oled_pixel_t *chrBuf)
{
    uint8_t foo             = 0, mask;
    const uint8_t *pChTable = selectedFont + 8 + (uint16_t)((charToWrite - selectedFont_firstChar) << 2);
    currentChar_width = *pChTable, currentChar_height = selectedFont_height;
    uint32_t offset          = (uint32_t)pChTable[1] | ((uint32_t)pChTable[2] << 8) | ((uint32_t)pChTable[3] << 16);
    const uint8_t *pChBitMap = selectedFont + offset;

    if (0 == isFontInitialized)
    {
        /* Set default font */
        OLED_SetFont(guiFont_10x10_Regular, 0xFFFF);
    }

    /* Allocate space for char image */
    *chrBuf = (oled_pixel_t)AllocateDynamicArea(currentChar_height * currentChar_width);

    if (NULL == *chrBuf)
    {
        return;
    }

    for (uint8_t yCnt = 0; yCnt < currentChar_height; yCnt++)
    {
        mask = 0;

        for (uint8_t xCnt = 0; xCnt < currentChar_width; xCnt++)
        {
            if (0 == mask)
            {
                mask = 1;
                foo  = *pChBitMap++;
            }

            if (0 != (foo & mask))
            {
                *(*chrBuf + yCnt * currentChar_width + xCnt) = selectedFont_color;
            }

            else
            {
                *(*chrBuf + yCnt * currentChar_width + xCnt) = 0;
            }

            mask <<= 1;
        }
    }
}

static void Transpose(oled_pixel_t transImage, const oled_pixel_t image, uint8_t width, uint8_t height)
{
    for (uint8_t i = 0; i < height; i++)
    {
        for (uint8_t j = 0; j < width; j++)
        {
            transImage[j * height + i] = image[i * width + j];
        }
    }
}

static oled_status_t TopDown(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height)
{
    uint16_t transStep   = OLED_TRANSITION_STEP;
    uint16_t partImgSize = width * transStep;
    uint8_t *partImgPtr  = (uint8_t *)image + (height - transStep) * (width * OLED_BYTES_PER_PIXEL);

    /* Set locations */
    while (1)
    {
        SetBorders(xCrd, yCrd, width, height);

        if (partImgSize > width * height)
        {
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)image, width * height * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
            break;
        }
        else
        {
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)partImgPtr, partImgSize * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
        }

        /* Update variables */
        partImgPtr -= (width * transStep) * OLED_BYTES_PER_PIXEL;
        partImgSize += (width * transStep);
        transStep++;
    }

