vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
    return OLED_STATUS_SUCCESS;
}

static oled_status_t DownTop(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height)
{
    uint16_t transStep   = OLED_TRANSITION_STEP;
    uint16_t partImgSize = width * transStep;
    oled_status_t status = OLED_STATUS_SUCCESS;
    uint8_t *partImgPtr  = (uint8_t *)image;
    uint8_t yCrd_moving  = (yCrd + height) - 1;

    /* Set locations */
    while (1)
    {
        if ((partImgSize > OLED_SCREEN_SIZE) || (yCrd_moving < yCrd))
        {
            /* Draw full image */
            SetBorders(xCrd, yCrd, width, height);
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)image, width * height * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
            break;
        }

        else
        {
            SetBorders(xCrd, yCrd_moving, width, (yCrd + height) - yCrd_moving);
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)partImgPtr, partImgSize * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
        }

        /* Update variables */
        yCrd_moving -= transStep;
        partImgSize += (width * transStep);
        transStep++;
    }

    return status;
}

static oled_status_t LeftRight(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height)
{
    oled_status_t status               = OLED_STATUS_SUCCESS;
    oled_dynamic_area_t transImageArea = {.xCrd = 0, .yCrd = 0, .width = 96, .height = 96};

    OLED_SetDynamicArea(&transImageArea);

    /* Helper pointer */
    oled_pixel_t transImage = (oled_pixel_t)oled_dynamic_area.areaBuffer;

    if (NULL == transImage)
    {
        return OLED_STATUS_INIT_ERROR;
    }

    Transpose((oled_pixel_t)transImage, (oled_pixel_t)image, width, height);

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_REMAP, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_REMAP_SETTINGS | REMAP_VERTICAL_INCREMENT, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    uint16_t transStep   = OLED_TRANSITION_STEP;
    uint16_t partImgSize = height * transStep;
    uint8_t *partImgPtr  = (uint8_t *)transImage + (width - transStep) * (height * OLED_BYTES_PER_PIXEL);

    /* Set locations */
    while (1)
    {
        SetBorders(xCrd, yCrd, width, height);

        if (partImgSize > width * height)
        {
            if (OLED_STATUS_SUCCESS !=
                OLED_SendData((const uint8_t *)transImage, width * height * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
            break;
        }
        else
        {
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)partImgPtr, partImgSize * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
        }

        if (OLED_STATUS_SUCCESS == status)
        {
            /* Update variables */
            partImgPtr -= (transStep * height) * OLED_BYTES_PER_PIXEL;
            partImgSize += (transStep * height);
            transStep++;
        }
    }

    if (OLED_STATUS_SUCCESS == status)
    {
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_REMAP, FIRST_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
        if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_REMAP_SETTINGS, OTHER_BYTE))
        {
            return OLED_STATUS_PROTOCOL_ERROR;
        }
    }

    OLED_DestroyDynamicArea();
    return status;
}

static oled_status_t RightLeft(const uint8_t *image, uint8_t xCrd, uint8_t yCrd, uint8_t width, uint8_t height)
{
    oled_dynamic_area_t transImageArea = {.xCrd = 0, .yCrd = 0, .width = 96, .height = 96};

    OLED_SetDynamicArea(&transImageArea);

    /* Helper pointer */
    oled_pixel_t transImage = oled_dynamic_area.areaBuffer;

    if (NULL == transImage)
    {
        return OLED_STATUS_INIT_ERROR;
    }

    Transpose((oled_pixel_t)transImage, (oled_pixel_t)image, width, height);

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_REMAP, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_REMAP_SETTINGS | REMAP_VERTICAL_INCREMENT, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }

    uint16_t transStep   = OLED_TRANSITION_STEP;
    uint16_t partImgSize = height * transStep;
    uint8_t *partImgPtr  = (uint8_t *)transImage;
    uint8_t xCrd_moving  = (xCrd + width) - 1;

    /* Set locations */
    while (1)
    {
        if ((partImgSize > width * height) || (xCrd_moving < xCrd))
        {
            SetBorders(xCrd, yCrd, width, height);
            if (OLED_STATUS_SUCCESS !=
                OLED_SendData((const uint8_t *)transImage, height * width * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
            break;
        }

        else
        {
            SetBorders(xCrd_moving, yCrd, (xCrd + width) - xCrd_moving, height);
            if (OLED_STATUS_SUCCESS != OLED_SendData((const uint8_t *)partImgPtr, partImgSize * OLED_BYTES_PER_PIXEL))
            {
                return OLED_STATUS_PROTOCOL_ERROR;
            }
        }

        /* Update variables*/
        xCrd_moving -= transStep;
        partImgSize += (height * transStep);
        transStep++;
    }

    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_CMD_SET_REMAP, FIRST_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    if (OLED_STATUS_SUCCESS != OLED_SendCmd(OLED_REMAP_SETTINGS, OTHER_BYTE))
    {
        return OLED_STATUS_PROTOCOL_ERROR;
    }
    /* Destory the dynamic area */
    OLED_DestroyDynamicArea();
    return OLED_STATUS_SUCCESS;
}

static oled_status_t CreateTextBackground(void)
{
    uint8_t xCrd = oled_dynamic_area.xCrd, yCrd = oled_dynamic_area.yCrd, width = oled_dynamic_area.width,
            height            = oled_dynamic_area.height;
    oled_pixel_t imgBuf       = oled_dynamic_area.areaBuffer, copyAddr;
    const uint8_t *background = oled_text_properties.background;

    /* Copy data */
    if ((NULL == imgBuf) || ((xCrd + width) > OLED_SCREEN_WIDTH) || ((yCrd + height) > OLED_SCREEN_HEIGHT))
    {
        return OLED_STATUS_INIT_ERROR;
    }

