vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/components/display/psp27801/fsl_psp27801.c
    if (NULL == background)
    {
        for (uint8_t i = 0; i < height; i++)
        {
            memset((void *)imgBuf, 0, width * OLED_BYTES_PER_PIXEL);
            imgBuf += width;
        }
    }

    else
    {
        copyAddr = (oled_pixel_t)(GuiDriver_SkipHeader(background)) + (yCrd * OLED_SCREEN_WIDTH + xCrd);
        for (uint8_t i = 0; i < height; i++)
        {
            OLED_Swap((oled_pixel_t)imgBuf, (const uint8_t *)copyAddr, width);
            imgBuf += width;
            copyAddr += OLED_SCREEN_WIDTH;
        }
    }

    return OLED_STATUS_SUCCESS;
}

static oled_status_t AddCharToTextArea(
    oled_pixel_t chrPtr, uint8_t chrWidth, uint8_t chrHeight, oled_pixel_t copyAddr, uint8_t imgWidth)
{
    if (NULL == copyAddr)
    {
        return OLED_STATUS_INIT_ERROR;
    }

    for (uint8_t i = 0; i < chrHeight; i++)
    {
        for (uint8_t j = 0; j < chrWidth; j++)
        {
            if (0 != chrPtr[j])
            {
                copyAddr[j] = chrPtr[j];
            }
        }
        copyAddr += imgWidth;
        chrPtr += chrWidth;
    }
    return OLED_STATUS_SUCCESS;
}

static void *AllocateDynamicArea(uint32_t area)
{
    void *ptr = malloc(area * OLED_BYTES_PER_PIXEL);
    if (NULL == ptr)
    {
        return NULL;
    }
    return ptr;
}

static oled_status_t DestroyDynamicArea(void *ptr)
{
    if (NULL == ptr)
    {
        return OLED_STATUS_INIT_ERROR;
    }
    else
    {
        free(ptr);
        return OLED_STATUS_SUCCESS;
    }
}
